Repository: vereni4/Drupal-tasks
Catalog: sites/all/translations/boost-7.x-1.0.*.po
Languages: ru

source: Pages
ru: Страницы

source: Status
ru: Статус

source: Description
ru: Описание

source: Disabled
ru: Отключено

source: Enabled
ru: Включено

source: Module
ru: Модуль

source: Cache specific pages
ru: Страницы с особенным кэшем

source: Not Installed
ru: Не установлен

source: Debug
ru: Отладка

source: @type settings
ru: настройки @type

source: Cache path
ru: Путь кэша

source: Boost cacheability settings
ru: Настройки кэширования Boost

source: Boost Apache .htaccess settings generation
ru: Настройки генерирования файла .htaccess

source: Best to leave these as %{}, only try the last option(s) if boost is still not working.
ru: Лучше оставьте %{}, попробуйте последнюю опцию только есть Boost не работает.

source: Generated Rules
ru: Сгенерированные правила

source: Boost: Pages cache status
ru: Boost: Статус кэша страниц

source: Flush Page
ru: Сбросить кэш страницы

source: Boost Settings
ru: Настройки Boost

source: Static page cache cleared.
ru: Статичный кэш страниц очищен.

source: !cache_dir: does not exist.
ru: !cache_dir: не существует.

source: Can not write to file-system
ru: Невозможно записать в файловую систему

source: File System
ru: Файловая система

source: <a href="!link">Explanation of .htaccess variables</a> <br /><br /> <strong>Be sure to save the configuration and then go to the <a href="!rules">htaccess rules generation page</a> and copy the rules.</strong>
ru: <a href="!link">Объяснение переменных .htaccess</a> <br /><br /> <strong>Обязательно сохраните конфигурацию и затем перейдите к <a href="!rules">сгенерированным правилам htaccess</a> и скопируйте их.</strong>

source: Value of %best is recommended for this server.
ru: Значение %best рекомендовано для этого сервера.

source: ETag Settings
ru: Настройки ETag

source: Uses <a href="!link">FileETag Directive</a> to set <a href="!about">ETags</a> for the files cached by Boost. <a href="!stack">More info on this subject</a>
ru: Использует <a href="!link">FileETag Directive</a>, чтобы установить <a href="!about">ETags</a> для кэшированных файлов. <a href="!stack">Больше информации об этом</a>

source: Boost installed correctly, should be working if properly <a href="@settings">configured</a>.
ru: Boost установлен верно, и должен работать, если надлежаще <a href="@settings">настроен</a>.

source: All pages except those listed
ru: Все страницы, кроме перечисленных

source: Only the listed pages
ru: Только на перечисленных страницах

source: Specify pages by using their paths. Enter one path per line. The '*' character is a wildcard. Example paths are %blog for the blog page and %blog-wildcard for every personal blog. %front is the front page.
ru: Вводите путь к каждой странице в отдельной строке. При указании пути можно использовать маску *. Например, если ввести <em>blog</em>, то действие будет распространяться только на страницу блогов, если ввести <em>blog/*</em>, то действие будет распространяться на все страницы имеющие в пути слово <em>blog</em> (страница блогов и все записи в персональных блогах). Для указания первой страницы, используйте запись %front.

source: Pages on which this PHP code returns <code>TRUE</code> (experts only)
ru: Если введённый PHP-код возвращает значение <code>TRUE</code>

source: Pages or PHP code
ru: Страницы или PHP код

source: If the PHP option is chosen, enter PHP code between %php. Note that executing incorrect PHP code can break your Drupal site.
ru: Если выбран пункт «Если введённый PHP-код возвращает значение <code>TRUE</code>», то будет выполнен код, заключённый в теги %php. Отметьте: выполнение неверного PHP-кода может повредить сайт.

source: Performance and scalability
ru: Производительность и масштабируемость

source: Cache Expiration
ru: Истечение срока действия кэша

source: Flushed all files (%count) from static page cache.
ru: Удалены все файлы (%count) из кэша.

source: Cache Enabled
ru: Кэш включен

source: Send debug info for each request to watchdog.
ru: Отправлять отладочную информацию для каждого запроса в watchdog.

source: Only use for debugging purposes as this can fill up watchdog fairly quickly.
ru: Используйте только для отладки, поскольку watchdog может быть заполнен очень быстро.

source: Ignore a cache flush command if cron issued the request.
ru: Игнорировать команду очистки кэша, созданную кроном.

source: Drupal will flush all caches when cron is executed, depending on the <a href="!urlcore">core minimum cache lifetime</a> setting. To ignore the request to flush the cache on cron runs, enable this option. If enabled, pages in the Boost cache will be flushed only when their <a href="!urlboost">Boost maximum cache lifetime</a> expires.
ru: Друпал очистит все кэши, когда будет исполнен крон, согласно системной настройке <a href="!urlcore"минимальное время жизни кэша</a>. Чтобы проигнорировать очистку кэша по запуску крона, включите опцию. Если включено, кэш будет очищен только по истечению <a href="!urlboost">максимального времени жизни кэша Boost</a>.

source: Remove old cache files on cron.
ru: Удалить старый кэш при запуске крона.

source: If enabled, each time cron runs Boost will check each cached page and delete those that have expired (maximum cache lifetime). The expiration time is displayed in the comment that Boost adds to the bottom of the html pages it creates. This setting is recommended for most sites.
ru: Если включено, каждый запуск крона Boost будет проверять каждую кэшированную страницу и удалять устаревшие (максимальное время жизни). Время устаревания отображается в комментарии, который Boost добавляет внизу каждой созданной html-страницы. Эта настройка рекомендуется в большинстве случаев.

source: Root cache directory
ru: Корневой каталог кэша

source: Normal cache directory
ru: Обычный каталог кэша

source: Character replacement for "?" in the URL
ru: Символ, заменяющий "?" в URL

source: Please <a href="!link">open an boost issue on Drupal.org</a>, since apache and php might not be configured correctly.
ru: <a href="!link">Откройте issue на Drupal.org</a>, если Apache и PHP не могут быть сконфигурированы корректно.

source: In order to identify that the page is being served from the cache, Boost can send out a header that will identify any files served from the boost cache.
ru: В целях определения, что страница передана из кэша, Boost посылает заголовок, идентифицирующий, что файл из кэша Boost.

source: Bypass the boost cache for ssl requests.
ru: Пропустить кэш Boost для ssl-запросов.

source: Ticking this is recommended if you use the securepages module.
ru: Включение рекомендуется при использовании модуля securepages.

source: Add "AddDefaultCharset X" to the htaccess rules
ru: Добавить "AddDefaultCharset X" к правилам htaccess

source: Depending on your i18n settings you might want this disabled or enabled. X is set below
ru: В зависимости от настроек i18n вы можете включить или выключить эту настройку. X указан ниже

source: Add "AddDefaultCharset utf-8" to the htaccess rules
ru: Добавить "AddDefaultCharset utf-8" к правилам htaccess

source: Depending on your i18n settings you might want this disabled or enabled.
ru: В зависимости от настроек i18n вы можете включить или выключить эту настройку.

source: Copy this into your .htaccess file below <pre><tt> # If your site is running in a VirtualDocumentRoot at http://example.com/, # uncomment the following line: # RewriteBase / </tt></pre> and above <pre><tt> # Pass all requests not referring directly to files in the filesystem to # index.php. Clean URLs are handled in drupal_environment_initialize().</tt></pre><br />Note that the generated rules' settings can be configure at !link.
ru: Скопируйте это в ваш .htaccess ниже <pre><tt> # If your site is running in a VirtualDocumentRoot at http://example.com/, # uncomment the following line: # RewriteBase / </tt></pre> и выше <pre><tt> # Pass all requests not referring directly to files in the filesystem to # index.php. Clean URLs are handled in drupal_environment_initialize().</tt></pre><br />Все сгенерированные правила могут быть настроены по ссылке !link.

source: Boost cache type settings
ru: Настройки типа кэша

source: @title settings
ru: @title настройки

source: Cache @description of type @type
ru: Кэш @description типа @type

source: Filename Extension
ru: Расширение файла

source: @type - Maximum Cache Lifetime
ru: @type - Максимальное время жизни кэша

source: @type - Minimum Cache Lifetime
ru: @type - Минимальное время жизни кэша

source: HTML output, usually a webpage
ru: HTML вывод, обычно веб-страница

source: XML output, usually a feed
ru: XML-вывод, обычно фид

source: JSON output, usually a response to a AJAX request
ru: JSON вывод, обычно результат запроса AJAX

source: Expired %count stale files from static page cache.
ru: Истекло %count файлов в кэше статичных страниц.

source: Could not create the file %file on your system
ru: Не удается создать файл %file в вашей системе

source: Could not rename the file %file on your system
ru: Не удается переименовать файл %file в вашей системе

source: Could not create the directory %dir on your system
ru: Не удается создать директорию %dir в вашей системе

source: Configuration for Boost.
ru: Настройка Boost.

source: Debug configuration for Boost.
ru: Отладочная информация Boost.

source: File system configuration for Boost.
ru: Файловая система. Настройки для Boost.

source: .htaccess configuration for Boost.
ru: настройки .htaccess для Boost.

source: .htaccess Settings
ru: Настройки .htaccess

source: .htaccess Generation
ru: Генерация .htaccess

source: .htaccess generation for Boost.
ru: Настройки генерации .htaccess

source: Cache expiration configuration for Boost.
ru: Настройки устаревания кэша.

source: Caches generated output as a static file to be served directly from the webserver.
ru: Кэширует снегенированный вывод как статичный файл для вывода с вебсервера.

source: This page will not be cached: %reason
ru: Это страница не будет кэширована: %reason

source: File: %filename
ru: Файл: %filename

source: Generated: %generated
ru: Создан: %generated

source: %filename was deleted from the Boost cache
ru: %filename был удален из кэша

source: %filename could not be deleted, check file permissions on disk to see if the web server can write/delete the file.
ru: %filename не может быть удален, проверьте права доступа к файлу.

source: %filename was not found in the Boost cache and could not be deleted.
ru: %filename не найден в кэше и не удален.

source: Flush pages from Boost cache
ru: Очистить страницы в кэше

source: Allow users to flush individual pages from the Boost cache using the Boost status block.
ru: Разрешить пользователям удалять отдельные страницы из кэша использую блок статуса кэша Boost.

source: Core cache is enabled
ru: Системный кэш включен

source: Boost will not function properly while Drupal core cache is enabled. Disable Boost or <a href="@settings">the core cache</a>.
ru: Boost не будет работать корректно с включенным системным кэшем Drupal. Отключите Boost или <a href="@settings">системный кэш</a>.

source: Pre-cache the pages of the website so they get cached before anyone accesses them.
ru: Прекэшировать страницы сайта, чтобы они были закэшированы еще до того, как кто-то к ним обратится.
